{
  "basics": {
    "name": "Dheeraj Tallapragada",
    "title": "CS @ UW",
    "image": "./assets/images/pic.png",
    "email": "dheerajt@uw.edu",
    "phone": "+19254049856",
    "location": "Dublin, CA, USA",
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "dheerajtallapragada",
        "url": "https://linkedin.com/in/dheerajtallapragada"
      },
      {
        "network": "GitHub",
        "username": "draj222",
        "url": "https://github.com/draj222"
      }
    ]
  },
  "summary": "Hi! I'm Dheeraj, incoming freshman at The University of Washington, passionate about the intersection between Machine Learning and Environmental Sustainability.\n\nFueled by curiosity and a desire to make an impact, I'm focused on creating data-driven solutions that push boundaries and address real-world challenges. I also advocate for sustainability policies with a mission to familiarize students with this niche field. I've explored machine learning through various research opportunities in areas like web/app development and predictive modeling.\n\nOutside of tech, I'm drawn to literature, sociology, and sports.\n\nI'd be happy to connect—feel free to reach out!",
  "skills": [
    {
      "category": "Programming Languages",
      "items": ["Python", "Java", "JavaScript", "C++", "C", "TypeScript", "C#", "Swift", "HTML/CSS"]
    },
    {
      "category": "Web Development",
      "items": ["React.js", "Next.js", "Tailwind CSS", "Bootstrap", "Responsive Design"]
    },
    {
      "category": "Machine Learning",
      "items": ["Neural Networks", "Computer Vision", "NLP", "TensorFlow", "PyTorch", "Data Analysis", "Model Training", "Data Preprocessing"]
    },
    {
      "category": "Development Tools",
      "items": ["Git", "Visual Studio Code", "IntelliJ", "CLion", "PyCharm", "Unity", "MATLAB"]
    },
    {
      "category": "Other Skills",
      "items": ["Research Methodology", "Technical Writing", "Public Speaking", "Leadership", "Project Management", "Statistical Analysis", "Curriculum Development"]
    }
  ],
  "languages": [
    { "language": "English", "fluency": "Native" },
    { "language": "Telugu", "fluency": "Native" }
  ],
  "work": [
    {
      "id": 1,
      "title": "Urgent Care Intern",
      "company": "Kaiser Permanente",
      "location": "Dublin, CA",
      "period": "Jun 2025 - Aug 2025",
      "responsibilities": [
        "Saved 730 manual data-entry hours per year by automating EHR documentation.",
        "Navigated Epic for appointment notes, breast and cervical cancer screening bookings, X-ray orders, patient rooming, vital sign collection, and radiology escorts.",
        "Support clinical operations by managing barcode-based specimen hand-offs to the lab, streamlining exam-room turnover with basic Lean methodologies, participating in daily Agile-style stand-ups to align on KP LAUNCH objectives, and shadowing IT (ticket triage & backup scripting), Administration (PeopleSoft reporting & compliance workflows), and Radiology (DICOM PACS auditing & imaging QC)",
        "Built and pitched a Python-based AI scanner leveraging NLP to extract screening and order data from patient profiles and auto-populate structured appointment notes."
      ]
    },
    {
      "id": 2,
      "title": "Research Partner",
      "company": "University of Texas, San Antonio",
      "location": "San Antonio, TX",
      "period": "Apr 2025 - Present",
      "responsibilities": [
        "Develop a two-stage deep learning pipeline that delivered 92% ROC AUC for satellite anomaly detection and 94% accuracy in field disease classification.",
        "Automate the processing of 5,000+ images, and cut inspection costs by 40% across 500 hectares.",
        "Conduct research under Dr. Kyrie Zhou to pioneer a scalable precision agriculture framework, supporting sustainable orchard management; integrate Sentinel-2 time series, UAV orthomosaics, and NOAA weather data into a unified pipeline for anomaly localization and tree-level classification"
      ]
    }
  ],
  "education": [
    {
      "degree": "Bachelor of Science in Computer Science",
      "institution": "University of Washington, Seattle",
      "period": "Sep 2025 - Present"
    },
    {
      "degree": "High School Diploma",
      "institution": "Dublin High School, Dublin",
      "period": "2021 - 2025"
    }
  ],
  "projects": [
    {
      "id": 1,
      "title": "Pitch Perfect",
      "role": "Developer",
      "language": "JavaScript, Python",
      "technology": "Discord Bot, AI",
      "folderName": "pitch-perfect",
      "description": "AI-powered Discord bot designed to help founders and entrepreneurs improve their startup pitches. Features real-time voice recording in Discord voice channels, AI transcription using Whisper technology, GPT-4 powered pitch analysis and feedback, detailed metrics on pitch content, delivery, and structure, and actionable improvement suggestions. Users can record up to 5-minute pitches and receive instant, professional-style feedback with specific insights on clarity, persuasiveness, and overall presentation.",
      "appLink": "https://www.pitch-perfect.app",
      "screenshots": []
    },
    {
      "id": 2,
      "title": "StopMeet",
      "role": "Developer",
      "language": "React, Node.js, PostgreSQL",
      "technology": "Web Application",
      "folderName": "stopmeet",
      "description": "AI-powered meeting governance platform designed to optimize organizational meeting practices. Features AI-powered tools that automatically audit calendars, recommend meeting cancellations, generate dynamic meeting agendas, and provide real-time meeting analysis. Includes advanced analytics to track meeting efficiency metrics, visualize meeting patterns, calculate meeting ROI, and generate custom reports. Smart meeting management capabilities centralize calendar views, flag meeting issues, optimize attendee participation, and manage meeting buffer times.",
      "githubLink": "https://github.com/draj222/stopmeet",
      "screenshots": []
    },
    {
      "id": 3,
      "title": "Predictive Maintenance in Digital Manufacturing",
      "role": "Researcher",
      "language": "Python, TensorFlow",
      "technology": "Machine Learning",
      "folderName": "predictive-maintenance",
      "description": "Deep learning framework for air quality monitoring and prediction that detects anomalies in air quality monitoring data from the EPA. Develops binary classification models for air quality using machine learning, focusing on PM2.5 and Ozone pollutants. Classifies air quality as 'normal' or 'hazardous' using LSTM and CNN models. LSTM model achieved 100% accuracy while CNN model achieved 99.87% accuracy, with ROC curves scoring perfectly (1.0 AUC). Aims to improve environmental monitoring systems and supports intelligent environmental monitoring for public health.",
      "githubLink": "https://github.com/draj222/Predictive-Maintenance-in-Digital-Manufacturing",
      "screenshots": []
    }
  ]
} 